"""Фермерське господарство закінчило рік із такми показниками прибутку :
     ячмінь - 28 900 грв.
     пшениця - 80 500 гра.
     соняник - 75 000 грв.
     кукурудза - 90 000 грв.
     Обчислити загальну суму прибутку ."""
"""1.Початок.
   2.Створити словник - profits - назв продукції і прибутку
   3.PROF = 0 # - початкова сума річного прибуткую
   4.i = 0
   5.PROF = PROF + значення profits[i]
   6.i = i + 1
   7.Якщо i < 3, то п. 5, інакше п.8
   8.Вивести PROF
   9.Кінець"""

profits = {'ячмінь': 28900, 'шениця': 80500,'соняшник':75000, 'кукурудза':90000}

PROF = 0
for i in profits.values():
    PROF += i

print('Річний прибуток = ',PROF, 'грв.')

print('--------------------------------------------------------')

""" У магазині продають таке :
      помідори- 16 грв. банани - 21 грв. лимони - 31 грв. яблука - 14 грв. огірки - 12 грв.
       Банани всі продано , а ціни на решту товарів знижено на 9 %.
       Надрукувати новий перелік товарів та їхні ціни. """
a_dict = {'Помідори': 16, 'Банани': 21, 'Лимони': 31, 'Яблука':14, 'Огірки':12,}

a_dict.pop('Банани')

for key,value in a_dict.items():
    a_dict[key] = round(value * 0.91,2)
print(a_dict)

print('-----------------------------------------------------')

