from random import randint,seed

print("Перехоплення винятків :")
# Список з двох елементів
nums = [1,2]
#  слово з шести букв
txt = 'Python'
# Цілочислена змінна
a = 10
# список з трьох елементів
names = [nums, a, txt]
# Ініціалізація генератора випадкових чисел
seed = (123)
#  Оператор циклу
for i in range(10):
    # Контрольний код
    try:
        # випадкове ціле число в діапазоні від 0 до 2
        n = randint(0,2)
        print("Згенероване число :",n)
        # Кількість елементів у списку або тексті
        # При спробі викликати функцію len() для цілого числа виникає помилка
        print("Кількість елементів :",len(names[n]))
        # Неправельний індекс або ділення на нуль
        names[n + 1] //= n
    # обробка помилки з не коректним типом даних
    except TypeError as err:
        print("Помилка :",err)
    except (LookupError,ArithmeticError) as err:
        print("Проблема з обчисленням :")
        print("Клас помилки -",err.__class__)
        print("-"*42)
print("Роботу закінчено")