a = int(input("Введіть перше число: "))
b = int(input("Введіть друге число: "))


if a > b:
    print("Перше число більше за друге — міняю їх місцями.")
    a, b = b, a

print("-----------------")

# сума чисел, що діляться на 4
sum4 = 0
print("Числа, які діляться на 4:")
for i in range(a, b + 1):
    if i % 4 == 0:
        print(i)
        sum4 += i
print("Сума чисел, що діляться на 4 =", sum4)

print("-----------------")

# сума чисел, що НЕ діляться на 6
sum6 = 0
print("Числа, які НЕ діляться на 6:")
for i in range(a, b + 1):
    if i % 6 != 0:
        print(i)
        sum6 += i
print("Сума чисел, які НЕ діляться на 6 =", sum6)
